#ifndef BITSCAN
#define BITSCAN

/*
					СПРАВКА:
================================================
Библиотека для реализации представления тайлов и
анализа информации, которую они содержат в себе.

================================================

Тайл представляет из себя 32-битовое целое без-
знаковое число, которое хранит в себе:

1. Информацию о проходимости / непроходимости
(самый значащий бит - 31 разряд);

2. Номер строки с текстурой
(с 30 по 26 разряды включительно);

3. Номер столбца с текстурой
(с 25 по 21 разряды включительно);

4. Уровень освещённости
(с 20 по 18 разряды включительно);

5. Оставшиеся резервные биты, которые могут 
быть использованы в будущем для кодирования
дополнительной информации. 
================================================

*/


#include <cstdint>


using Tile = std::uint32_t;


//==============================================
//				Битовые маски
//==============================================


constexpr Tile ILLUMINATION_MASK = 0x001C0000;
constexpr Tile PASSABILITY_MASK = 0x80000000;
constexpr Tile COLUMN_MASK = 0x03E00000;
constexpr Tile ROW_MASK = 0x7C000000;


//==============================================
//		Функции для извлечения информации
//==============================================


bool isPassable(const Tile tile);


std::uint32_t getRow(const Tile tile);


std::uint32_t getColumn(const Tile tile);


std::uint32_t getIllumination(const Tile tile);


#endif // !BITSCAN

